{
  "body": [
    {
      "title": "Cloud DevOps Engineer",
      "icon": "solar:programming-bold-duotone",
      "company": "VPBank",
      "location": "Hanoi, Vietnam",
      "start": "Feb 2025",
      "end": "",
      "description": "Currently part of the Tech Platform team, specializing in API integration and AWS SFTP Transfer Family solutions.",
      "slot": "description",
      "details": [
        "Managed IBM API Connect across cloud and on-premise environments, enabling internal teams to securely expose and share services with internal stakeholders, external clients, and partners.",
        "Assisted in administering cloud-based SFTP solutions using AWS Transfer Family, implementing enhancements that improved efficiency and reliability of file transfer operations."
      ]
    },
    {
      "title": "Senior Software Engineer",
      "icon": "solar:chat-square-code-bold-duotone",
      "company": "TUI",
      "location": "Hanoi, Vietnam",
      "start": "Jan 2022",
      "end": "Jan 2025",
      "description": "Integrated travel content with Juniper and TravelgateX, optimized hotel data for chains like Marriott, and built scalable insurance APIs. Improved performance and reduced costs through technical debt resolution.",
      "slot": "description",
      "details": [
        "Led the integration of TUI's content with leading travel industry providers and channel managers, including Juniper and TravelgateX, to enhance the platform's capabilities.",
        "Streamlined hotel content integration for complex hotel chains like Marriott, ensuring accurate and up-to-date data.",
        "Architected and implemented a robust API gateway for insurance services, enhancing system flexibility and scalability.",
        "Resolved critical technical debts related to hotel mapping, improving data accuracy and system performance.",
        "Optimized service performance and database usage to reduce costs and increase booking conversions."
      ]
    },
    {
      "title": "Senior Software Engineer",
      "icon": "solar:chat-square-code-bold-duotone",
      "company": "Viemart LLC",
      "location": "Hanoi, Vietnam",
      "start": "Mar 2021",
      "end": "Nov 2021",
      "description": "Led development of a cross-border e-commerce platform with print-on-demand and dropshipping features. Integrated with Shopify, WooCommerce, and Etsy; developed shipment tracking tools using Node.js and VueJS.",
      "slot": "description",
      "details": [
        "Led the development of a cross-border e-commerce platform, Viemart, specializing in print-on-demand and dropshipping solutions.",
        "Integrated with major marketplaces like Viermart, Shopify, WooCommerce, and Etsy to provide a comprehensive e-commerce experience.",
        "Established strategic partnerships with warehousing and fulfillment providers to streamline product storage and order fulfillment.",
        "Developed VieFlash, a real-time shipment tracking platform for partners to monitor order statuses efficiently.",
        "Utilized Node.js, VueJS, Redis, and Docker for full-stack development, ensuring a scalable and reliable platform."
      ]
    },
    {
      "title": "Senior Software Engineer",
      "icon": "solar:chat-square-code-bold-duotone",
      "company": "ABIVIN",
      "location": "Hanoi, Vietnam",
      "start": "Dec 2020",
      "end": "Feb 2021",
      "description": "Modernized authentication systems using Fastify, improved system stability, and enhanced reporting capabilities.",
      "slot": "description",
      "details": [
        "Led the modernization of authentication services by migrating from ExpressJS to Fastify, significantly improving performance and scalability.",
        "Resolved critical bugs and addressed technical debt to enhance system reliability and efficiency.",
        "Implemented strategic optimizations to improve reporting capabilities, ensuring accurate and timely data insights."
      ]
    },
    {
      "title": "Full-Stack Developer",
      "icon": "solar:code-circle-bold-duotone",
      "company": "KMSoft",
      "location": "Hanoi, Vietnam",
      "start": "Apr 2020",
      "end": "Nov 2020",
      "description": "Built high-performance crypto trading platforms (Daollobit, Tadadex) using Golang, Node.js, and React with real-time updates.",
      "slot": "description",
      "details": [
        "Architected and developed core systems, APIs, and web applications for innovative cryptocurrency trading platforms.",
        "Contributed significantly to the development of Daollobit and Tadadex, pioneering solutions for a seamless and efficient cryptocurrency trading experience.",
        "Demonstrated proficiency in full-stack development utilizing Golang, Node.js, ReactJS, WebSocket, and WebPush Notifications.",
        "Delivered high-performance, scalable, and secure applications that met the demanding requirements of the cryptocurrency market.",
        "Leveraged cutting-edge technologies to provide real-time updates and notifications, enhancing user engagement and satisfaction."
      ]
    },
    {
      "title": "Software Development Team Lead",
      "icon": "solar:code-circle-bold-duotone",
      "company": "GoQuo",
      "location": "Hanoi, Vietnam",
      "start": "Mar 2015",
      "end": "Mar 2020",
      "description": "Led development of a microservices-based travel booking API. Built scalable systems, modernized infrastructure with Kubernetes, and reduced cloud costs by up to 80%.",
      "slot": "description",
      "roles": [
        {
          "icon": "solar:check-read-line-duotone",
          "title": "Software Development Team Lead",
          "date": "Jan 2018 - Mar 2020",
          "details": [
            "Led the Gateway Team in architecting and implementing a microservices-based API system for travel booking, significantly enhancing operational efficiency.",
            "Unified disparate models into a cohesive framework, ensuring seamless integration and scalability across the platform.",
            "Implemented industry best practices to deliver a robust, reliable, and highly available system capable of handling peak demand.",
            "Developed a new hotel mapping system using Neo4j, resolving legacy issues and improving data accuracy.",
            "Empowered management teams with a user-friendly ReactJS-based admin dashboard for efficient booking management and configuration.",
            "Enhanced customer experiences by developing a modern, responsive client site using VueJS.",
            "Modernized development processes by establishing Kubernetes infrastructure and implementing standardized CI/CD pipelines using Helm charts for streamlined deployment.",
            "Significantly reduced operational costs by leveraging AWS spot instances and GCP pre-emptible VMs, achieving cost savings of 60-80%.",
            "Cultivated a high-performing team through mentorship, code reviews, and knowledge sharing.",
            "Expanded team capacity by successfully recruiting and onboarding new talent."
          ]
        },
        {
          "icon": "solar:check-read-line-duotone",
          "title": "Node.js Developer",
          "date": "Mar 2015 - Dec 2017",
          "details": [
            "Reengineered hotel and tour gateway API using Node.js to create a unified interface for multiple suppliers.",
            "Enhanced maintainability and scalability through a well-structured, modular architecture.",
            "Utilized MariaDB/MySQL for efficient data storage and management.",
            "Leveraged Redis for high-performance caching and real-time data access."
          ]
        }
      ]
    }
  ]
}
